def to_words(n):
  u = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
  t = ["", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
  d = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
  if not isinstance(n, int) or not 0 <= n <= 99:
    return "Ошибка"
    
  if n < 10: 
      return u[n]
  elif 10 <= n <20:
      return "десять" if n == 10 else t[n - 10]
      return d[n // 10]  + (" " + u[n % 10]
if n % 10 else "")
        
while True: 
  try: 
    n = int(input("0-99: "))
    print(to_words(n))
    break
  except:
    print("Ошибка")