единицы = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
десятки = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
исключения = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]

num_str = input("Введите число от 0 до 99: ")

try:
    num = int(num_str)

    if 0 <= num <= 99:
        if num < 10:
            print(единицы[num])
        elif 10 <= num <= 19:
            print(исключения[num - 10])
        else:
            десят = num // 10
            един = num % 10
            print(десятки[десят], единицы[един])
    else:
        print("Число должно быть от 0 до 99.")

except ValueError:
    print("Вы должны ввести число."
